src/InformationRegisters/ЗапросыКНСИ/ЗапросыКНСИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗапросыКНСИ</name>
  <resources>
    <name>ТипЗапроса</name>
    <type>
      <types>EnumRef.ТипыЗапросовКНСИ</types>
    </type>
  </resources>
  <resources>
    <name>ПочтовоеСообщение</name>
    <type>
      <types>DocumentRef.ПочтовоеСообщение</types>
    </type>
  </resources>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЗапросыКНСИ/ManagerModule.bsl
///////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ДобавитьЗапись(Объект, ТипЗапроса, ПочтовоеСообщение) Экспорт
	Идентификатор				= Новый УникальныйИдентификатор;
	Запись 						= РегистрыСведений.ЗапросыКНСИ.СоздатьМенеджерЗаписи();
	Запись.Объект 				= Объект; 	
	Запись.Идентификатор 		= Идентификатор;
	Запись.ТипЗапроса 			= ТипЗапроса;
	Запись.ПочтовоеСообщение 	= ПочтовоеСообщение;
	Запись.Записать();
	Возврат Идентификатор;
КонецФункции // ДобавитьЗапись
